{"article_id": "220622464", "title": "Kasikornbank Leads These 3 Dividend Stocks To Consider", "content": "In the midst of a dynamic global market environment, U.S. indices like the Dow Jones Industrial Average and S&P 500 have reached record highs, buoyed by positive sentiment surrounding domestic policy changes and economic stability efforts. As investors navigate these shifting tides, dividend stocks remain an attractive option for those seeking steady income streams amidst market volatility.Top 10 Dividend StocksNameDividend YieldDividend RatingPeoples Bancorp (NasdaqGS:PEBO)4.56%★★★★★★Tsubakimoto Chain (TSE:6371)4.17%★★★★★★CAC Holdings (TSE:4725)4.57%★★★★★★Yamato Kogyo (TSE:5444)3.88%★★★★★★Padma Oil (DSE:PADMAOIL)6.64%★★★★★★Financial Institutions (NasdaqGS:FISI)4.43%★★★★★★Nihon Parkerizing (TSE:4095)3.88%★★★★★★FALCO HOLDINGS (TSE:4671)6.85%★★★★★★Premier Financial (NasdaqGS:PFC)4.48%★★★★★★Banque Cantonale Vaudoise (SWX:BCVN)4.91%★★★★★★Click here to see the full list of 1948 stocks from our Top Dividend Stocks screener.Here's a peek at a few of the choices from the screener.KasikornbankSimply Wall St Dividend Rating:★★★★☆☆Overview:Kasikornbank Public Company Limited, along with its subsidiaries, offers commercial banking products and services both in Thailand and internationally, with a market cap of THB 363.69 billion.Operations:Kasikornbank's revenue segments include Retail Business at THB 69.98 billion, Corporate Business at THB 87.72 billion, Muang Thai Group Holding Business at THB 13.42 billion, and Treasury and Capital Markets Business and World Business Group at THB 32.99 billion.Dividend Yield:4.9%Kasikornbank's dividend payments, covered by a low payout ratio of 37.4%, are supported by recent earnings growth of 34%. However, the bank's dividends have been volatile over the past decade and its current yield of 4.89% is below top-tier dividend payers in Thailand. Despite high non-performing loans at 3.8%, a new joint venture aims to manage these assets, potentially stabilizing future financial health and dividend reliability.Unlock comprehensive insights into our analysis of Kasikornbank stock in this dividend report.Our expertly prepared valuation report Kasikornbank implies its share price may be lower than expected.SET:KBANK Dividend History as at Dec 2024Compagnie Financière TraditionSimply Wall St Dividend Rating:★★★★★☆Overview:Compagnie Financière Tradition SA is an interdealer broker facilitating transactions in financial and non-financial products globally, with a market capitalization of CHF1.27 billion.Operations:Compagnie Financière Tradition SA generates revenue from various regions, with CHF352.67 million from the Americas, CHF273.16 million from Asia-Pacific, and CHF452.85 million from Europe, the Middle East and Africa.Story ContinuesDividend Yield:3.7%Compagnie Financière Tradition offers a stable dividend history over the past decade, with payments well-covered by earnings and cash flows, indicated by a payout ratio of 43.3% and cash payout ratio of 60.7%. Although its current yield of 3.67% is below the top quartile in Switzerland, it trades at a discount to estimated fair value. Recent earnings growth of 16.1% supports its capacity for continued reliable dividends despite some shareholder dilution last year.Navigate through the intricacies of Compagnie Financière Tradition with our comprehensive dividend report here.Our valuation report unveils the possibility Compagnie Financière Tradition's shares may be trading at a discount.SWX:CFT Dividend History as at Dec 2024Lion Travel ServiceSimply Wall St Dividend Rating:★★★★★☆Overview:Lion Travel Service Co., Ltd. offers travel services both in Taiwan and internationally, with a market cap of NT$11.75 billion.Operations:The company's revenue primarily comes from its Tour Department, which generated NT$28.15 billion.Dividend Yield:6.3%Lion Travel Service demonstrates a mixed dividend profile. Despite a top-tier dividend yield of 6.35% in Taiwan, the company's dividends have been volatile over the past decade. However, with a payout ratio of 49.3% and cash payout ratio of 32.3%, dividends are well-covered by earnings and cash flows, suggesting sustainability despite an unstable track record. Recent earnings growth supports this coverage, although large one-off items have impacted financial results recently.Click to explore a detailed breakdown of our findings in Lion Travel Service's dividend report.The analysis detailed in our Lion Travel Service valuation report hints at an deflated share price compared to its estimated value.TWSE:2731 Dividend History as at Dec 2024Taking AdvantageClick here to access our complete index of 1948Top Dividend Stocks.Are any of these part of your asset mix?Tap into the analytical power of Simply Wall St's portfolioto get a 360-degree view on how they're shaping up.Simply Wall St is a revolutionary app designed for long-term stock investors, it's free and covers every market in the world.Ready To Venture Into Other Investment Styles?Explorehigh-performing small cap companiesthat haven't yet garnered significant analyst attention.Fuel your portfolio withcompanies showing strong growth potential, backed by optimistic outlooks both from analysts and management.Findcompanies with promising cash flow potential yet trading below their fair value.This article by Simply Wall St is general in nature.We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.Companies discussed in this article include SET:KBANK SWX:CFT and TWSE:2731.Have feedback on this article? Concerned about the content?Get in touchwith us directly.Alternatively, emaileditorial-team@simplywallst.com", "url": "https://finance.yahoo.com/news/kasikornbank-leads-3-dividend-stocks-220622464.html", "published_date": "2024-12-03T22:06:22.000Z"}
{"article_id": "180219778", "title": "Kasikornbank And Two Dividend Stocks For Your Portfolio", "content": "As global markets experience a surge, with U.S. stock indexes nearing record highs and European indices buoyed by positive economic signals, investors are closely monitoring inflation data that could influence future rate policies. In this dynamic environment, dividend stocks like Kasikornbank offer potential stability and income generation, making them an attractive consideration for those looking to balance growth with consistent returns in their portfolios.Top 10 Dividend StocksNameDividend YieldDividend RatingGuaranty Trust Holding (NGSE:GTCO)5.89%★★★★★★Wuliangye YibinLtd (SZSE:000858)3.96%★★★★★★Peoples Bancorp (NasdaqGS:PEBO)4.90%★★★★★★Nihon Parkerizing (TSE:4095)3.88%★★★★★★Citizens & Northern (NasdaqCM:CZNC)5.23%★★★★★★Southside Bancshares (NYSE:SBSI)4.60%★★★★★★GakkyushaLtd (TSE:9769)4.40%★★★★★★Guangxi LiuYao Group (SHSE:603368)3.43%★★★★★★HUAYU Automotive Systems (SHSE:600741)4.36%★★★★★★DoshishaLtd (TSE:7483)3.88%★★★★★★Click here to see the full list of 1984 stocks from our Top Dividend Stocks screener.Underneath we present a selection of stocks filtered out by our screen.KasikornbankSimply Wall St Dividend Rating:★★★★☆☆Overview:Kasikornbank Public Company Limited, along with its subsidiaries, offers commercial banking products and services both in Thailand and internationally, with a market cap of THB385.02 billion.Operations:Kasikornbank's revenue segments include Retail Business at THB69.98 billion, Corporate Business at THB87.72 billion, Muang Thai Group Holding Business at THB13.42 billion, and Treasury and Capital Markets Business and World Business Group at THB32.99 billion.Dividend Yield:4.6%Kasikornbank's dividend payments are well covered by its earnings, with a current payout ratio of 37.4%, projected to remain sustainable at 44.2% in three years. Although the bank's dividends have increased over the past decade, they have been volatile with occasional drops over 20%. Despite trading below estimated fair value and offering good relative value compared to peers, its dividend yield of 4.62% is lower than top-tier payers in Thailand.Navigate through the intricacies of Kasikornbank with our comprehensive dividend report here.Our comprehensive valuation report raises the possibility that Kasikornbank is priced lower than what may be justified by its financials.SET:KBANK Dividend History as at Feb 2025TorigoeSimply Wall St Dividend Rating:★★★★★☆Overview:Torigoe Co., Ltd. manufactures and sells flours and related products in Japan, with a market capitalization of ¥17.97 billion.Operations:Torigoe Co., Ltd.'s revenue primarily comes from its Food Products segment, which generated ¥26.17 billion.Story ContinuesDividend Yield:5.7%Torigoe's dividend yield of 5.7% ranks in the top 25% of Japanese dividend payers, yet its sustainability is questionable with a payout ratio exceeding earnings at 100.5%. Although dividends have been stable and growing over the past decade, recent share price volatility poses risks. The cash payout ratio stands at 78.7%, indicating coverage by cash flows but not earnings. Trading significantly below estimated fair value suggests potential for capital appreciation amidst these challenges.Take a closer look at Torigoe's potential here in our dividend report.Insights from our recent valuation report point to the potential overvaluation of Torigoe shares in the market.TSE:2009 Dividend History as at Feb 2025Hirogin HoldingsSimply Wall St Dividend Rating:★★★★☆☆Overview:Hirogin Holdings, Inc. is a bank holding company for The Hiroshima Bank, Ltd., with a market cap of ¥366.87 billion.Operations:Hirogin Holdings, Inc. generates its revenue primarily through its operations as a bank holding company for The Hiroshima Bank, Ltd.Dividend Yield:3.8%Hirogin Holdings plans to increase its annual dividend to ¥23.50 per share from ¥19.00, reflecting growth but with a history of volatility and unreliability over the past decade. The payout ratio is a manageable 38.6%, suggesting dividends are covered by earnings, though sustainability concerns remain due to insufficient data on future coverage. With earnings projected at ¥35 billion and a P/E ratio of 12.5x below the market average, Hirogin presents an attractive valuation despite these challenges.Click to explore a detailed breakdown of our findings in Hirogin Holdings' dividend report.Our expertly prepared valuation report Hirogin Holdings implies its share price may be too high.TSE:7337 Dividend History as at Feb 2025Seize The OpportunityDelve into our full catalog of 1984Top Dividend Stockshere.Are you invested in these stocks already? Keep abreast of every twist and turn bysetting up a portfolio with Simply Wall St, where we make it simple for investors like you to stay informed and proactive.Invest smarter with the free Simply Wall St app providing detailed insights into every stock market around the globe.Curious About Other Options?Explorehigh-performing small cap companiesthat haven't yet garnered significant analyst attention.Fuel your portfolio withcompanies showing strong growth potential, backed by optimistic outlooks both from analysts and management.Findcompanies with promising cash flow potential yet trading below their fair value.This article by Simply Wall St is general in nature.We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.Companies discussed in this article include SET:KBANK TSE:2009 and TSE:7337.Have feedback on this article? Concerned about the content?Get in touchwith us directly.Alternatively, emaileditorial-team@simplywallst.com", "url": "https://finance.yahoo.com/news/kasikornbank-two-dividend-stocks-portfolio-180219778.html", "published_date": "2025-02-18T18:02:19.000Z"}
