{"article_id": "140615245", "title": "Top Dividend Stocks To Consider In November 2024", "content": "As global markets navigate the uncertainties surrounding the incoming Trump administration's policies, investors are witnessing a mixed performance across sectors, with financials and energy shares benefiting from deregulation hopes while healthcare stocks face pressure. Amidst this backdrop of fluctuating indices and economic signals, dividend stocks remain an attractive option for those seeking steady income streams in uncertain times. A good dividend stock typically offers a reliable payout history and resilience to market volatility, aligning well with current conditions where stability is highly valued.Top 10 Dividend StocksNameDividend YieldDividend RatingGuaranty Trust Holding (NGSE:GTCO)6.78%★★★★★★Peoples Bancorp (NasdaqGS:PEBO)4.54%★★★★★★Tsubakimoto Chain (TSE:6371)4.19%★★★★★★CAC Holdings (TSE:4725)4.60%★★★★★★Padma Oil (DSE:PADMAOIL)6.72%★★★★★★Financial Institutions (NasdaqGS:FISI)4.37%★★★★★★James Latham (AIM:LTHM)6.06%★★★★★★Citizens & Northern (NasdaqCM:CZNC)5.58%★★★★★★Premier Financial (NasdaqGS:PFC)4.39%★★★★★★Banque Cantonale Vaudoise (SWX:BCVN)4.95%★★★★★★Click here to see the full list of 1957 stocks from our Top Dividend Stocks screener.Let's dive into some prime choices out of the screener.PTTSimply Wall St Dividend Rating:★★★★☆☆Overview:PTT Public Company Limited, along with its subsidiaries, operates in the petroleum industry across Thailand and internationally, with a market capitalization of approximately THB942.58 billion.Operations:PTT Public Company Limited's revenue is primarily derived from its Downstream Petroleum - International Trading segment at THB2.07 billion, followed by Downstream Petroleum - Petrochemicals and Refining at THB1.38 billion, Upstream Petroleum and Natural Gas - Natural Gas at THB602.37 million, Downstream Petroleum - Oil and Retail at THB733.67 million, New Business and Sustainability (NBS) at THB120.10 million, and Upstream Petroleum and Natural Gas - Petroleum Exploration and Production at THB315.42 million.Dividend Yield:5.9%PTT's dividend payments have grown over the past decade, yet they remain volatile with an unstable track record. The dividends are well-covered by both earnings and cash flows, with payout ratios of 50.2% and 38%, respectively. However, its dividend yield of 5.93% is lower than the top quartile in Thailand's market. Recent earnings showed a decline in net income for Q3 compared to last year, potentially impacting future dividend stability.Click here to discover the nuances of PTT with our detailed analytical dividend report.According our valuation report, there's an indication that PTT's share price might be on the cheaper side.Story ContinuesSET:PTT Dividend History as at Nov 2024DaicelSimply Wall St Dividend Rating:★★★★★☆Overview:Daicel Corporation operates in the materials, medical/healthcare, smart, safety, and engineering plastics sectors across Japan, China, and internationally with a market cap of ¥366.76 billion.Operations:Daicel Corporation's revenue is primarily derived from its Engineering Plastics Business at ¥242.85 billion, Material Business at ¥195.47 billion, Safety Business at ¥95.51 billion, Smart Business at ¥35.82 billion, and Medical/Healthcare segment at ¥14.24 billion.Dividend Yield:4.3%Daicel's dividend yield of 4.34% ranks in the top quartile of the Japanese market, though it's not covered by free cash flows. Despite a high debt level, dividends have been stable and growing over the past decade, supported by a low payout ratio of 11.9%. The company recently increased its annual dividend forecast to ¥60 per share amid revised earnings guidance and announced a share buyback program to enhance shareholder returns.Delve into the full analysis dividend report here for a deeper understanding of Daicel.Our expertly prepared valuation report Daicel implies its share price may be lower than expected.TSE:4202 Dividend History as at Nov 2024Sato HoldingsSimply Wall St Dividend Rating:★★★★★☆Overview:Sato Holdings Corporation manufactures and sells labeling products both in Japan and internationally, with a market cap of ¥69.77 billion.Operations:Sato Holdings Corporation generates revenue through its labeling products business, serving both domestic and international markets.Dividend Yield:3.4%Sato Holdings offers a stable dividend with a yield of 3.37%, although it falls short compared to the top dividend payers in Japan. Over the past decade, dividends have grown reliably, supported by a low payout ratio of 26.1% and cash payout ratio of 35.7%, indicating strong coverage by earnings and cash flows. Recent collaborations, such as with Konica Minolta for sustainable manufacturing practices, may enhance its long-term operational stability and appeal to environmentally conscious investors.Get an in-depth perspective on Sato Holdings' performance by reading our dividend report here.Our comprehensive valuation report raises the possibility that Sato Holdings is priced higher than what may be justified by its financials.TSE:6287 Dividend History as at Nov 2024Where To Now?Take a closer look at ourTop Dividend Stockslist of 1957 companies by clicking here.Invested in any of these stocks?Simplify your portfolio management with Simply Wall Stand stay ahead with our alerts for any critical updates on your stocks.Discover a world of investment opportunities with Simply Wall St's free app and access unparalleled stock analysis across all markets.Seeking Other Investments?Explorehigh-performing small cap companiesthat haven't yet garnered significant analyst attention.Fuel your portfolio withcompanies showing strong growth potential, backed by optimistic outlooks both from analysts and management.Findcompanies with promising cash flow potential yet trading below their fair value.This article by Simply Wall St is general in nature.We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.Companies discussed in this article include SET:PTT TSE:4202 and TSE:6287.Have feedback on this article? Concerned about the content?Get in touchwith us directly.Alternatively, emaileditorial-team@simplywallst.com", "url": "https://finance.yahoo.com/news/top-dividend-stocks-consider-november-140615245.html", "published_date": "2024-11-22T14:06:15.000Z"}
{"article_id": "220917654", "title": "Top Asian Dividend Stocks To Consider In March 2025", "content": "As global markets navigate through a period of uncertainty, with concerns about U.S. trade policies and inflation impacting investor sentiment, Asian markets have shown resilience, particularly in Japan and China where economic strategies are being closely monitored. In such a climate, dividend stocks can offer stability and potential income streams for investors seeking to balance risk amidst market fluctuations.Top 10 Dividend Stocks In AsiaNameDividend YieldDividend RatingWuliangye YibinLtd (SZSE:000858)3.71%★★★★★★Chongqing Rural Commercial Bank (SEHK:3618)8.05%★★★★★★CAC Holdings (TSE:4725)4.92%★★★★★★Tsubakimoto Chain (TSE:6371)4.04%★★★★★★Nihon Parkerizing (TSE:4095)3.87%★★★★★★Intelligent Wave (TSE:4847)3.75%★★★★★★GakkyushaLtd (TSE:9769)3.95%★★★★★★DoshishaLtd (TSE:7483)3.80%★★★★★★Guangxi LiuYao Group (SHSE:603368)3.17%★★★★★★HUAYU Automotive Systems (SHSE:600741)4.17%★★★★★★Click here to see the full list of 1123 stocks from our Top Asian Dividend Stocks screener.Let's review some notable picks from our screened stocks.PTTSimply Wall St Dividend Rating:★★★★☆☆Overview:PTT Public Company Limited operates in the petroleum industry across Thailand, Asia, Europe, the United States, and internationally with a market cap of THB849.75 billion.Operations:PTT Public Company Limited's revenue is primarily derived from its Downstream Petroleum - International Trading segment at THB1.94 billion, followed by the Downstream Petroleum - Petrochemicals and Refining at THB1.35 billion, Downstream Petroleum - Oil and Retail at THB727.03 million, Upstream Petroleum and Natural Gas - Natural Gas at THB579.59 million, New Business and Sustainability (NBS) at THB114.20 million, and Upstream Petroleum and Natural Gas - Petroleum Exploration and Production at THB312.31 million.Dividend Yield:7.1%PTT's recent announcement of a THB 1.30 per share dividend, payable from retained earnings, reflects its commitment to shareholder returns despite a decline in net income to THB 90.07 billion for 2024. While PTT's dividends are well covered by both earnings and cash flows, the company's dividend history has been volatile over the past decade. The Olefins Feedstock Security Project may enhance long-term competitiveness but does not directly address the reliability of future dividends.Click here and access our complete dividend analysis report to understand the dynamics of PTT.Upon reviewing our latest valuation report, PTT's share price might be too pessimistic.SET:PTT Dividend History as at Mar 2025Midea GroupSimply Wall St Dividend Rating:★★★★★★Overview:Midea Group Co., Ltd. operates in the manufacturing and sale of home appliances, as well as robotic and automation systems both in China and internationally, with a market cap of CN¥575.15 billion.Story ContinuesOperations:Midea Group Co., Ltd. generates its revenue through the production and distribution of home appliances and robotic and automation systems across domestic and international markets.Dividend Yield:3.9%Midea Group's dividend is well-covered by both earnings and cash flows, with a payout ratio of 55% and a cash payout ratio of 34.2%, ensuring sustainability. The stock trades slightly below its estimated fair value, offering good relative value in the market. Midea's dividends are stable and have grown over the past decade, ranking in the top 25% for yield in China at 3.92%. Recent product innovations emphasize energy efficiency, potentially supporting long-term growth.Dive into the specifics of Midea Group here with our thorough dividend report.Our valuation report unveils the possibility Midea Group's shares may be trading at a discount.SZSE:000333 Dividend History as at Mar 2025SeikaSimply Wall St Dividend Rating:★★★★★☆Overview:Seika Corporation is involved in the import, sale, and export of plants, machinery, and environmental protection and electronic information system equipment across Asia, Europe, the United States, and other international markets with a market cap of ¥58.88 billion.Operations:Seika Corporation's revenue segments include the import, sale, and export of plants, machinery, environmental protection equipment, and electronic information systems across various international markets.Dividend Yield:5.3%Seika's dividend is well-supported by earnings and cash flows, with a payout ratio of 26.9% and a cash payout ratio of 59.4%. Despite past volatility in dividends, recent increases to JPY 130 per share indicate growth potential. The stock trades at a discount to its estimated fair value. Recent guidance revisions show improved financial performance due to strategic partnerships and strong project deliveries, enhancing Seika’s position in the energy sector.Click here to discover the nuances of Seika with our detailed analytical dividend report.According our valuation report, there's an indication that Seika's share price might be on the cheaper side.TSE:8061 Dividend History as at Mar 2025Where To Now?Reveal the 1123 hidden gems among ourTop Asian Dividend Stocksscreener with a single click here.Already own these companies? Bring clarity to your investment decisions bylinking up your portfolio with Simply Wall St, where you can monitor all the vital signs of your stocks effortlessly.Simply Wall St is your key to unlocking global market trends, a free user-friendly app for forward-thinking investors.Interested In Other Possibilities?Explorehigh-performing small cap companiesthat haven't yet garnered significant analyst attention.Fuel your portfolio withcompanies showing strong growth potential, backed by optimistic outlooks both from analysts and management.Findcompanies with promising cash flow potential yet trading below their fair value.This article by Simply Wall St is general in nature.We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.Companies discussed in this article include SET:PTT SZSE:000333 and TSE:8061.Have feedback on this article? Concerned about the content?Get in touchwith us directly.Alternatively, emaileditorial-team@simplywallst.com", "url": "https://finance.yahoo.com/news/top-asian-dividend-stocks-consider-220917654.html", "published_date": "2025-03-19T22:09:17.000Z"}
{"article_id": "160901668", "title": "Three Top Dividend Stocks To Consider For Your Portfolio", "content": "As global markets navigate the end of the year with mixed signals, including a decline in U.S. consumer confidence and fluctuating stock index performances, investors are seeking stability amid economic uncertainty. In such an environment, dividend stocks can offer a compelling option for those looking to balance potential growth with regular income streams.Top 10 Dividend StocksNameDividend YieldDividend RatingPeoples Bancorp (NasdaqGS:PEBO)5.05%★★★★★★Tsubakimoto Chain (TSE:6371)4.09%★★★★★★CAC Holdings (TSE:4725)4.84%★★★★★★Yamato Kogyo (TSE:5444)4.04%★★★★★★Padma Oil (DSE:PADMAOIL)7.42%★★★★★★GakkyushaLtd (TSE:9769)4.38%★★★★★★Nihon Parkerizing (TSE:4095)3.83%★★★★★★FALCO HOLDINGS (TSE:4671)6.38%★★★★★★E J Holdings (TSE:2153)3.82%★★★★★★Citizens & Northern (NasdaqCM:CZNC)6.02%★★★★★★Click here to see the full list of 1958 stocks from our Top Dividend Stocks screener.We'll examine a selection from our screener results.Al Waha Capital PJSCSimply Wall St Dividend Rating:★★★★☆☆Overview:Al Waha Capital PJSC is a private equity firm managing assets in sectors such as financial services, healthcare, energy, and real estate with a market cap of AED3.25 billion.Operations:Al Waha Capital PJSC's revenue segments include Private Investments (Excluding Waha Land) amounting to AED149.88 million.Dividend Yield:6.4%Al Waha Capital PJSC's dividend yield of 6.37% ranks in the top 25% of AE market payers, though its dividends have been volatile and unreliable over the past decade. Despite a low payout ratio of 37.2%, dividends are not covered by free cash flows, raising sustainability concerns. Recent earnings growth is notable, with net income for Q3 2024 at AED 77.56 million, up from AED 53.63 million year-on-year, suggesting potential financial stability improvements.Click to explore a detailed breakdown of our findings in Al Waha Capital PJSC's dividend report.The valuation report we've compiled suggests that Al Waha Capital PJSC's current price could be inflated.ADX:WAHA Dividend History as at Jan 2025PTTSimply Wall St Dividend Rating:★★★★☆☆Overview:PTT Public Company Limited, along with its subsidiaries, operates in the petroleum industry across Thailand and internationally, with a market cap of approximately THB906.88 billion.Operations:PTT Public Company Limited's revenue segments include Downstream Petroleum - Oil and Retail at THB733.67 million, New Business and Sustainability (NBS) at THB120.10 million, Downstream Petroleum - International Trading at THB2.07 billion, Upstream Petroleum and Natural Gas - Natural Gas at THB602.37 million, Downstream Petroleum - Petrochemicals and Refining at THB1.38 billion, and Upstream Petroleum and Natural Gas - Petroleum Exploration and Production at THB315.42 million.Story ContinuesDividend Yield:6.3%PTT's dividend yield of 6.3% is below the top 25% in Thailand, and its payments have been volatile over the past decade. Despite this, dividends are well covered by earnings and cash flows with payout ratios of 50.2% and 38%, respectively. Recent Q3 earnings showed a decline in net income to THB 16.32 billion from THB 31.30 billion year-on-year, indicating potential challenges in sustaining dividend growth amidst fluctuating financial performance.Click here to discover the nuances of PTT with our detailed analytical dividend report.Our valuation report here indicates PTT may be undervalued.SET:PTT Dividend History as at Jan 2025Li Ming Development ConstructionSimply Wall St Dividend Rating:★★★★☆☆Overview:Li Ming Development Construction Co., Ltd. operates in the construction industry and has a market capitalization of NT$5.88 billion.Operations:Li Ming Development Construction Co., Ltd. generates its revenue primarily from Real Estate Development, amounting to NT$7.57 billion.Dividend Yield:6%Li Ming Development Construction's dividend yield is among the top 25% in Taiwan at 6.03%, but its payments have been unreliable over nine years, with volatility and a history of drops exceeding 20%. Despite this, dividends are well covered by earnings and cash flows, with payout ratios of 45.6% and 12.7%, respectively. Recent Q3 results show increased earnings but lower profit margins year-on-year, highlighting potential challenges in maintaining stable dividends amidst financial fluctuations.Dive into the specifics of Li Ming Development Construction here with our thorough dividend report.In light of our recent valuation report, it seems possible that Li Ming Development Construction is trading behind its estimated value.TPEX:6212 Dividend History as at Jan 2025Summing It All UpUnlock more gems! OurTop Dividend Stocksscreener has unearthed 1955 more companies for you to explore.Click here to unveil our expertly curated list of 1958Top Dividend Stocks.Already own these companies?Link your portfolio to Simply Wall Stand get alerts on any new warning signs to your stocks.Elevate your portfolio with Simply Wall St, the ultimate app for investors seeking global market coverage.Seeking Other Investments?Explorehigh-performing small cap companiesthat haven't yet garnered significant analyst attention.Fuel your portfolio withcompanies showing strong growth potential, backed by optimistic outlooks both from analysts and management.Findcompanies with promising cash flow potential yet trading below their fair value.This article by Simply Wall St is general in nature.We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.Companies discussed in this article include ADX:WAHA SET:PTT and TPEX:6212.Have feedback on this article? Concerned about the content?Get in touchwith us directly.Alternatively, emaileditorial-team@simplywallst.com", "url": "https://finance.yahoo.com/news/three-top-dividend-stocks-consider-160901668.html", "published_date": "2025-01-02T16:09:01.000Z"}
{"article_id": "160159973", "title": "Top Dividend Stocks Including Bangkok Dusit Medical Services", "content": "As global markets navigate the complexities of rising inflation and geopolitical uncertainties, U.S. stock indexes are approaching record highs, driven by growth stocks outpacing value shares. In such a dynamic environment, dividend stocks continue to attract attention for their potential to provide steady income streams, with companies like Bangkok Dusit Medical Services exemplifying the attributes investors often seek in reliable dividend-paying stocks.Top 10 Dividend StocksNameDividend YieldDividend RatingGuaranty Trust Holding (NGSE:GTCO)5.87%★★★★★★Padma Oil (DSE:PADMAOIL)7.49%★★★★★★Peoples Bancorp (NasdaqGS:PEBO)4.90%★★★★★★Daito Trust ConstructionLtd (TSE:1878)4.04%★★★★★★CAC Holdings (TSE:4725)4.00%★★★★★★Citizens & Northern (NasdaqCM:CZNC)5.23%★★★★★★Southside Bancshares (NYSE:SBSI)4.60%★★★★★★Guangxi LiuYao Group (SHSE:603368)3.36%★★★★★★HUAYU Automotive Systems (SHSE:600741)4.32%★★★★★★DoshishaLtd (TSE:7483)3.86%★★★★★★Click here to see the full list of 1968 stocks from our Top Dividend Stocks screener.Here's a peek at a few of the choices from the screener.Bangkok Dusit Medical ServicesSimply Wall St Dividend Rating:★★★★☆☆Overview:Bangkok Dusit Medical Services Public Company Limited, along with its subsidiaries, operates hospitals in Thailand and internationally, with a market cap of THB355.98 billion.Operations:The primary revenue segment for Bangkok Dusit Medical Services Public Company Limited is its hospital operations, generating THB106.99 billion.Dividend Yield:3%Bangkok Dusit Medical Services faces challenges for dividend investors due to a volatile and unreliable dividend history over the past decade. Despite this, the company's dividends are supported by earnings with a payout ratio of 71.2% and cash flows with an 89.6% cash payout ratio, indicating sustainability in payments. However, its 3% yield is low compared to top Thai dividend payers, and analysts expect significant stock price appreciation from current levels.Navigate through the intricacies of Bangkok Dusit Medical Services with our comprehensive dividend report here.Our comprehensive valuation report raises the possibility that Bangkok Dusit Medical Services is priced lower than what may be justified by its financials.SET:BDMS Dividend History as at Feb 2025PTTSimply Wall St Dividend Rating:★★★★☆☆Overview:PTT Public Company Limited, along with its subsidiaries, operates in the petroleum industry across Thailand and internationally, with a market capitalization of THB885.45 billion.Operations:PTT Public Company Limited's revenue segments include Downstream Petroleum - International Trading at THB2.07 billion, Downstream Petroleum - Petrochemicals and Refining at THB1.38 billion, Downstream Petroleum - Oil and Retail at THB733.67 million, Upstream Petroleum and Natural Gas - Natural Gas at THB602.37 million, New Business and Sustainability (NBS) at THB120.10 million, and Upstream Petroleum and Natural Gas - Petroleum Exploration and Production at THB315.42 million.Story ContinuesDividend Yield:6.4%PTT's dividends are well-covered, with a 50.2% payout ratio from earnings and 38% from cash flows, suggesting sustainability despite a volatile dividend history over the past decade. The stock trades significantly below its estimated fair value, offering potential upside. However, PTT's dividend yield of 6.4% is modest compared to top Thai payers at 7.58%. Recent board meetings discussed strategic changes and the dissolution of a subsidiary, potentially impacting future financials and dividends.Click to explore a detailed breakdown of our findings in PTT's dividend report.The analysis detailed in our PTT valuation report hints at an deflated share price compared to its estimated value.SET:PTT Dividend History as at Feb 2025Ping An BankSimply Wall St Dividend Rating:★★★★★☆Overview:Ping An Bank Co., Ltd. offers commercial banking products and services to individuals, corporations, government agencies, institutions, and small businesses both in China and internationally with a market cap of CN¥224.14 billion.Operations:Ping An Bank Co., Ltd.'s revenue segments include commercial banking services for individuals, corporations, government agencies, institutions, and small businesses across China and international markets.Dividend Yield:4.2%Ping An Bank's dividend yield of 4.18% ranks in the top 25% within the CN market, supported by a low payout ratio of 42.9%, indicating sustainable dividends despite historical volatility. The forecasted payout ratio is expected to decrease to 29.8% in three years, further ensuring coverage by earnings. Trading at approximately 29.7% below its estimated fair value suggests potential upside, though investors should consider its unstable dividend track record when assessing reliability.Unlock comprehensive insights into our analysis of Ping An Bank stock in this dividend report.In light of our recent valuation report, it seems possible that Ping An Bank is trading behind its estimated value.SZSE:000001 Dividend History as at Feb 2025Summing It All UpClick through to start exploring the rest of the 1965Top Dividend Stocksnow.Are any of these part of your asset mix?Tap into the analytical power of Simply Wall St's portfolioto get a 360-degree view on how they're shaping up.Simply Wall St is your key to unlocking global market trends, a free user-friendly app for forward-thinking investors.Looking For Alternative Opportunities?Explorehigh-performing small cap companiesthat haven't yet garnered significant analyst attention.Fuel your portfolio withcompanies showing strong growth potential, backed by optimistic outlooks both from analysts and management.Findcompanies with promising cash flow potential yet trading below their fair value.This article by Simply Wall St is general in nature.We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.Companies discussed in this article include SET:BDMS SET:PTT and SZSE:000001.Have feedback on this article? Concerned about the content?Get in touchwith us directly.Alternatively, emaileditorial-team@simplywallst.com", "url": "https://finance.yahoo.com/news/top-dividend-stocks-including-bangkok-160159973.html", "published_date": "2025-02-17T16:01:59.000Z"}
