{"article_id": "122155902", "title": "Telcos Advanced Info, Thaicom want investors to reject offers under parent merger", "content": "By Rishav Chatterjee(Reuters) -The boards of Thailand-based mobile carriers Advanced Info Service and Thaicom have asked investors to reject offers to acquire the firms under the merger of their respective controlling entities, the companies said on Thursday.In July 2024, power producer Gulf Energy Development, the largest shareholder of Thaicom, and Intouch Holdings, which controls Advanced, announced their intent to merge to create a new company for maximizing benefits for both the firms and improving operations and investments.A merger of Gulf and Intouch, already approved by shareholders of Thai billionaire Sarath Ratanavadi's power company, would create a new entity valued at 1.037 trillion baht ($30 billion).Sarath has a net worth of $15.1 billion according to Forbes and is the country's fifth richest person.Gulf owns about 47.4% stake in Intouch, followed by Singapore Telecommunication (Singtel) which has an around 25% interest.Gulf has a joint venture with Singtel and Advanced to set up data centres locally and is expected to begin operations this year.A tender offer was launched for Advanced, by Gulf Energy, Intouch and Singtel, valuing the firm at 216.30 baht per share, with the offer later being lowered to 211.43 baht.Gulf, in an emailed response to Reuters said its tender offer price was final and it does not intend to revise that.The independent financial adviser's recommendations to reject the offers will not impact the merger process, Gulf added.Advanced said its financial adviser found the revised price to be lower than its estimated valuation range of 229.55 baht to 285.70 baht.Shares of Advanced closed 1.1% higher at 290 baht apiece on Thursday.A Singtel spokesperson told Reuters that the firm does not intend to revise its offer either.\"The announcement by both the companies was expected by the market. The price of both the stocks are higher than the tender offers and so the boards suggested investors to reject the tender offer. This does not post a major risk to the proposed merger,\" said Varorith Chirachon, head of investment research group at SCB Asset Management.As part of the restructuring, a similar tender offer was launched, under which, Gulf Energy, Intouch and Sarath offered to buy 58.9% of Thaicom at 11 baht apiece.Thaicom said its rising stock price since the merger announcement is the primary reason it is asking shareholders to vote against the deal.Its shares ended flat at 12.3 baht on Thursday.($1 = 34.5700 baht)(Reporting by Rishav Chatterjee in Bengaluru; Additional reporting by Aaditya Govind Rao; Editing by Mrigank Dhaniwala and David Evans)", "url": "https://finance.yahoo.com/news/thai-telcos-advanced-thaicom-want-122155902.html", "published_date": "2025-01-16T15:10:10.000Z"}
{"article_id": "150025710", "title": "Advanced Info Service PCL (AVIFY) Q3 2024 Earnings Call Highlights: Strong Broadband Growth and ...", "content": "Broadband Subscriber Base:Close to 5 million subscribers.Cloud Revenue Growth:Boosted by large cloud projects in the quarter.Green Funding Initiatives:Launched Green Bonds and Green Loans for sustainability projects.9-Month Performance:Exceeded guidance due to increased economic stability and tourism rise.Warning! GuruFocus has detected 8 Warning Signs with AVIFY.Release Date: November 01, 2024For the complete transcript of the earnings call, please refer to thefull earnings call transcript.Positive PointsAdvanced Info Service PCL (AVIFY) reported healthy growth in its mobile business, driven by stable competition and increased data consumption.The company maintained growth in its broadband segment, nearing a subscriber base of 5 million, with a focus on upselling higher-value packages.Enterprise non-mobile services benefited from increased demand for EDS and cloud services, with significant cloud revenue growth from large projects.The company launched green funding initiatives, including Green Bonds and Green Loans, to support sustainability-focused projects like expanding 5G networks in rural areas.Advanced Info Service PCL (AVIFY) exceeded its 9-month performance guidance, benefiting from increased economic stability and a steady rise in tourism.Negative PointsThe company faces challenges from a lower GDP forecast due to weaker consumer sentiment, slower private investment, and recent flooding impacts.Consumer sentiment for the fourth quarter remains uncertain, with GDP forecasts revised down despite expected government stimulus.There is a potential for increased CapEx in the future, as the company strategizes its investments for next year.The company experienced a sequential decline in blended ARPU, attributed to seasonality and optimization of device subsidies.Advanced Info Service PCL (AVIFY) is closely monitoring the impact of recent floods, which heavily affected customers in Thailand's northern and northeastern provinces.Q & A HighlightsQ: Can you share recent trends in monthly revenues, especially after the flooding impact?A: Revenue growth continues with minimal impact from flooding. We see benefits from price repair flowing through this quarter and into the next, with stable growth expected.Q: What are your plans regarding CapEx for next year, considering the 5G network build-out?A: There are some delays in CapEx investment this year, but we plan to maintain our guidance. Next year's strategy is not finalized, but if business remains the same, CapEx might decrease.Q: How did the third quarter handset sales perform, and what is the outlook for the fourth quarter?A: Handset sales showed strong performance with high gross margins. We expect continued growth in Q4, especially with high season sales and potential government stimulus packages.Story ContinuesQ: Can you explain the robust net subscriber additions for mobile and broadband services this quarter?A: The improvement is mainly due to reduced churn rather than increased gross additions. For broadband, new subscribers come from both new households and competitors, with a stable churn rate.Q: What is the status of the spectrum auction, and how does it affect AIS's strategy?A: AIS will consider participating in every frequency auction, including 2.1 and 2.3 GHz. The decision will depend on conditions, timing, and pricing. Future auctions for 3.5 GHz and other spectrums are anticipated but not immediate.For the complete transcript of the earnings call, please refer to thefull earnings call transcript.This article first appeared onGuruFocus.", "url": "https://finance.yahoo.com/news/advanced-pcl-avify-q3-2024-150025710.html", "published_date": "2024-11-04T15:00:25.000Z"}
{"article_id": "070522952", "title": "Advanced Info Service PCL (AVIFY) Q4 2024 Earnings Call Highlights: Strong Profit Growth and ...", "content": "Mobile Revenue Growth:4.8% year-on-year increase.Broadband Subscribers:Reached 5 million.Enterprise Nonmobile Growth:22% year-on-year increase.Sales Margin Improvement:Increased from 1.8% in 2023 to 5.6% in 2024.Net Profit:THB35 billion and THB75 million, a 21% year-on-year growth.Leverage Ratio:Declined from 2.9 times in 2023 to 2.2 times in 2024.Dividend Per Share:THB10.61 with a payout ratio of 90%.CapEx Budget:THB26 billion to THB27 billion.Warning! GuruFocus has detected 8 Warning Signs with AVIFY.Release Date: February 07, 2025For the complete transcript of the earnings call, please refer to thefull earnings call transcript.Positive PointsAdvanced Info Service PCL (AVIFY) reported a 4.8% year-on-year growth in mobile revenue, driven by superior network and rising data consumption.The broadband business maintained momentum, reaching 5 million subscribers, supported by network expansion and value-added services.Enterprise non-mobile revenue grew 22% year-on-year, driven by strong demand for connectivity and cloud services.The company exceeded its guidance upper bound for both core service revenue and EBITDA, reflecting strong business performance and operational efficiencies.A net profit of THB35 billion and THB75 million was achieved, representing a 21% year-on-year growth, with a dividend per share of THB10.61 approved for a full-year payout ratio of 90%.Negative PointsThe company faced mixed market sentiment due to weak consumer confidence and slow private investment in Thailand.There is a cautious outlook on EBITDA growth, which is expected to align with revenue growth at 3% to 5%, despite being an infrastructure capital-intensive business.The integration efforts, while on track, require significant focus on IT integration to achieve a unified operation by 2026.The CapEx budget for 2025 is substantial, around THB26 billion to THB27 billion, with emphasis on modernization and integration costs.Concerns were raised about the potential impact of spectrum auction outcomes on future network CapEx and competitiveness.Q & A HighlightsQ: What is the outlook for data consumption growth in the consumer segment, especially with the rise of AI technologies?A: Pratthana Leelapanang, Chief Consumer Business Officer, explained that data consumption is expected to continue growing, particularly as more devices can broadcast data. AI technologies will likely facilitate more information processing, leading to an estimated 15% year-on-year growth in data consumption over the next three to five years.Q: Why is the EBITDA growth guidance similar to the revenue growth guidance of 3% to 5%?A: An unidentified company representative noted that the EBITDA growth reflects variable costs that impact the EBITDA line. The depreciation and amortization levels are expected to remain similar year-on-year, aligning EBITDA growth with revenue growth.Story ContinuesQ: What are the implications of acquiring additional spectrum in the upcoming auction?A: Pratthana Leelapanang stated that acquiring additional spectrum, such as 1,800 MHz, would require minimal additional network CapEx due to existing infrastructure. However, acquiring new spectrum bands like TDD would necessitate more investment.Q: Can you elaborate on the changes in prepaid ARPU and the impact of tariff rationalization?A: Pratthana Leelapanang highlighted that the focus on quality customer acquisition and eliminating unsustainable plans has led to an increase in prepaid ARPU. The industry is moving towards more sustainable pricing, which has helped rationalize market offerings.Q: What are the plans for synergy and cost savings between AIS and 3BB?A: Tee Seeumpornroj, CEO of Broadband Business, mentioned ongoing efforts to integrate networks, consolidate shops, and optimize procurement to achieve cost savings. The goal is to have a unified operation by the end of the year or early next year.For the complete transcript of the earnings call, please refer to thefull earnings call transcript.This article first appeared onGuruFocus.", "url": "https://finance.yahoo.com/news/advanced-pcl-avify-q4-2024-070522952.html", "published_date": "2025-02-08T07:05:22.000Z"}
